package E

import "testing"

func TestE计算数学表达式(t *testing.T) {
	t.Log("E计算数学表达式", E计算数学表达式("1+1"))
	t.Log("E计算数学表达式", E计算数学表达式("2*2"))
	t.Log("E计算数学表达式", E计算数学表达式("2/2"))
	t.Log("E计算数学表达式", E计算数学表达式("2/0"))
	t.Log("E计算数学表达式", E计算数学表达式("2>0"))
	t.Log("E计算数学表达式", E计算数学表达式("2<0"))
	t.Log("E计算数学表达式", E计算数学表达式("2-20"))
	t.Log("E计算数学表达式", E计算数学表达式("'2014-01-02' > '2014-01-01 23:59:59'"))
	t.Log("E计算数学表达式", E计算数学表达式("'2014-01-02' < '2014-01-01 23:59:59'"))
	t.Log("E计算数学表达式", E计算数学表达式("'2014-01-02' == '2014-01-02'"))

}
